app/controllers/item_statuses_controller.rb

  def index
    @item_statuses = ItemStatus.all
---
SELECT "item_statuses".* FROM "item_statuses"