app/controllers/sellers_controller.rb

  def index
    @sellers = Seller.all
---
SELECT "sellers".* FROM "sellers"

    def set_seller
      @seller = Seller.find(params[:id])
---
SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]